// 주석 : 실행 시 영향을 미치지 않는 구문(코드 설명용)

// package : 클래스의 묶음으로 클래스를 용도별/기능별로 그룹화 한 것.
package 기본설정;

public class Ex01_기능파악 {

    // main 메소드 : 실행하기 위한 메소드
    public static void main(String[] args) {
        // ------------------------------
        // 영역을 나타내는 표시 {} 중괄호
        // 열고 닫는 중괄호의 개수는 같아야한다.
        // 자주색 글씨 : 키워드(이름으로 사용 불가능)

        // 단축키 ------------------------------
        // Ctrl+/ : 여러줄 주석 처리
        // Ctrl+Space : 자동 완성
        // Ctrl+F11 : 실행
        // Ctrl+Alt+방향키 : 해당 줄 방향키 위치로 복사
        // Ctrl+D : 해당 줄 삭제
        // Alt+방향키 : 해당 줄 이동
        // Ctrl+s : 저장
        // Ctrl+z : 되돌리기
        // Ctrl+y : 되살리기
        // Shift+Home/End : 처음/끝까지 드래그
        // 오류 -----------------------------------
        // Python : Run Time Error(실행을 해야 에러를 알 수 있음)
        // Java : Statement Error(코드 작성 시 에러 출력)

        // 빨간줄 : 컴파일 오류 -> 실행 불가능
        // 노란줄 : 경고 -> 실행 가능
        // .java vs.class -----------------------------------
        // .java : 프로그래머가 소스코드를 작성하는 파일
        // .class : JVM이 읽는 파일
        // .java파일을 실행하면 .class파일이 생성
        // workspace -> 프로젝트 -> bin 밑에 class 파일이 생성

    }

}
